import type { z } from 'zod';
import type { MapDefSchema } from './schema/map';

export const maps: z.input<typeof MapDefSchema>[] = [
  {
    // 測試地圖：房間、長牆缺口、U 型死路、柱列、訓練木樁
    id: 'map.test_1',
    rows: [
      '##############################',
      '#S...........#...............#',
      '#............#...............#',
      '#....####....#.....#####.....#',
      '#....#..#....#.....#...#.....#',
      '#....#..#....#.....#...#.....#',
      '#....#.......#.....#.........#',
      '#............#...............#',
      '#............#####.###########',
      '#............................#',
      '#..........##.....##.........#',
      '#..........#.......#.........#',
      '####.....###.......###.......#',
      '#..........................#.#',
      '#..#..#..#..#..#...........#.#',
      '#..........................#.#',
      '#######.############.......#.#',
      '#..................#.......#.#',
      '#..................#.......#.#',
      '#...#########......#.........#',
      '#...#.......#......#.........#',
      '#...#..............######....#',
      '#............................#',
      '##############################',
    ],
    spawns: [
      { enemyId: 'enemy.training_dummy', at: [8.5, 2.5] },
      { enemyId: 'enemy.training_dummy', at: [10.5, 5.5] },
      { enemyId: 'enemy.training_dummy', at: [3.5, 6.5] },
      { enemyId: 'enemy.training_dummy', at: [15.5, 10.5] },
      // 左下大房間：5 隻一群，測試群體追擊不重疊
      { enemyId: 'enemy.skeleton', at: [10.5, 17.5] },
      { enemyId: 'enemy.skeleton', at: [12.5, 17.5] },
      { enemyId: 'enemy.skeleton', at: [14.5, 17.5] },
      { enemyId: 'enemy.skeleton', at: [11.5, 18.5] },
      { enemyId: 'enemy.skeleton', at: [13.5, 18.5] },
      // 右側零星分布
      { enemyId: 'enemy.skeleton', at: [24.5, 4.5] },
      { enemyId: 'enemy.skeleton', at: [26.5, 6.5] },
      { enemyId: 'enemy.skeleton', at: [21.5, 1.5] },
      { enemyId: 'enemy.skeleton', at: [24.5, 14.5] },
      { enemyId: 'enemy.skeleton', at: [22.5, 17.5] },
    ],
    chests: [
      { at: [4.5, 4.5], lootTable: 'loot.chest' },
      { at: [27.5, 1.5], lootTable: 'loot.chest' },
      { at: [2.5, 21.5], lootTable: 'loot.chest' },
    ],
  },
];
